_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_5 (Lambda)            (None, 64, 64, 3)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 30, 30, 24)        1824      
_________________________________________________________________
activation_21 (Activation)   (None, 30, 30, 24)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 13, 13, 36)        21636     
_________________________________________________________________
activation_22 (Activation)   (None, 13, 13, 36)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 5, 5, 48)          43248     
_________________________________________________________________
activation_23 (Activation)   (None, 5, 5, 48)          0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 5, 5, 64)          27712     
_________________________________________________________________
activation_24 (Activation)   (None, 5, 5, 64)          0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 5, 5, 64)          36928     
_________________________________________________________________
activation_25 (Activation)   (None, 5, 5, 64)          0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 5, 5, 64)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 100)               160100    
_________________________________________________________________
dropout_14 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 50)                5050      
_________________________________________________________________
dropout_15 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 51        
=================================================================
Total params: 296,549
Trainable params: 296,549
Non-trainable params: 0
_________________________________________________________________
